tutorials/IncompressibleLimit/Cylinder_15k_M010/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "";
    case "";
    instance "";
    local "";

    class volVectorField;
    object U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (34.0292287 0.0 0.0);

boundaryField
{
inlet-outlet
{
    type            fixedValue;
    value           uniform (34.0292287 0.0 0.0);
}

body
{
    type            slip;
}

defaultFaces
{
    type            empty;
}

}


// ************************************************************************* //
